# InternalProblemsParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..InternalProblemsParameter Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Parameter cannot be changed due to internal problems.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InternalProblemsParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InternalProblemsParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InternalProblemsParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace